
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 14 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.envelopes_staging_queue_listen_access_key
  * azurerm_key_vault_secret.envelopes_staging_queue_listen_conn_str[0]
  * azurerm_key_vault_secret.envelopes_staging_queue_send_access_key
  * azurerm_key_vault_secret.envelopes_staging_queue_send_conn_str[0]
  * azurerm_key_vault_secret.payments_staging_queue_listen_access_key
  * azurerm_key_vault_secret.payments_staging_queue_listen_conn_str[0]
  * azurerm_key_vault_secret.payments_staging_queue_send_access_key
  * azurerm_key_vault_secret.payments_staging_queue_send_conn_str[0]
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_access_key
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_conn_str[0]
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_send_access_key
  * azurerm_key_vault_secret.processed_envelopes_staging_queue_send_conn_str[0]
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.payments-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.envelopes_staging_queue_listen_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "envelopes_staging_queue_listen_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/envelopes-staging-queue-listen-shared-access-key/1669041c4a9b4e2182dd914a76400848"
        name                    = "envelopes-staging-queue-listen-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.envelopes_staging_queue_listen_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "envelopes_staging_queue_listen_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/envelopes-staging-queue-listen-connection-string/cad06b88e65e451a888815d68f58ab8d"
        name                    = "envelopes-staging-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.envelopes_staging_queue_send_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "envelopes_staging_queue_send_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/envelopes-staging-queue-send-shared-access-key/477815fbccfc4d65801fd8e6b61b8d5d"
        name                    = "envelopes-staging-queue-send-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.envelopes_staging_queue_send_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "envelopes_staging_queue_send_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/envelopes-staging-queue-send-connection-string/2ccd43fec0ec4424a2c77af7425c0deb"
        name                    = "envelopes-staging-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.payments_staging_queue_listen_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "payments_staging_queue_listen_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/payments-staging-queue-listen-shared-access-key/5685245dde1f4033bc759b588c9c9f55"
        name                    = "payments-staging-queue-listen-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.payments_staging_queue_listen_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "payments_staging_queue_listen_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/payments-staging-queue-listen-connection-string/00ba77a2018e465496d741a7866906f5"
        name                    = "payments-staging-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.payments_staging_queue_send_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "payments_staging_queue_send_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/payments-staging-queue-send-shared-access-key/20de0b61c0ee4786821ce0c81273519d"
        name                    = "payments-staging-queue-send-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.payments_staging_queue_send_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "payments_staging_queue_send_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/payments-staging-queue-send-connection-string/9acbd86ae2b34b1fa64215dfee15b943"
        name                    = "payments-staging-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_listen_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/processed-envelopes-staging-queue-listen-shared-access-key/454539c81ee04f09b4c1a58383af00d3"
        name                    = "processed-envelopes-staging-queue-listen-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_listen_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_listen_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/processed-envelopes-staging-queue-listen-connection-string/f45d2789d97f4376900f6434d1829507"
        name                    = "processed-envelopes-staging-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_send_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_send_access_key" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/processed-envelopes-staging-queue-send-shared-access-key/fde7d9b4c8f44acf99b861cc0a3793a8"
        name                    = "processed-envelopes-staging-queue-send-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.processed_envelopes_staging_queue_send_conn_str[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "processed_envelopes_staging_queue_send_conn_str" {
        id                      = "https://bulk-scan-aat.vault.azure.net/secrets/processed-envelopes-staging-queue-send-connection-string/78579363c6d946f1aa7f417a141e7ab9"
        name                    = "processed-envelopes-staging-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.Resources/deployments/BSP_alert"
        name                = "BSP_alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/envelopes-staging" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "envelopes-staging"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat-premium" # forces replacement
        # (13 unchanged attributes hidden)

      - timeouts {}
    }

  # module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/envelopes-staging/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/envelopes-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/envelopes-staging/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/envelopes-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.payments-staging-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/payments-staging" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "payments-staging"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat-premium" # forces replacement
        # (13 unchanged attributes hidden)

      - timeouts {}
    }

  # module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/payments-staging/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/payments-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.payments-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/payments-staging/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/payments-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/processed-envelopes-staging" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "processed-envelopes-staging"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat" -> "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat-premium" # forces replacement
        # (13 unchanged attributes hidden)

      - timeouts {}
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/processed-envelopes-staging/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/processed-envelopes-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.processed-envelopes-staging-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/processed-envelopes-staging/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.ServiceBus/namespaces/bulk-scan-servicebus-aat/queues/processed-envelopes-staging" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bulk-scan-aat/providers/Microsoft.KeyVault/vaults/bulk-scan-aat|bulk-scan-aat"
        name                       = "bulk-scan-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 14 to change, 9 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":281,"Program":"tfcmt","SHA1":"","Vars":{}} -->